# KJPerK Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..KJPerK Property
SymbolTypeId Class See Also
---
Symbol kJ/K, indicating unit Kilojoules per Kelvin.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId KJPerK { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property KJPerK As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ KJPerK {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace